#ifndef GAME_H
#define GAME_H
#include "Board.h"
//מנגנון קלט האחראי על קבלת עמודה מהמשתמש
int getPlayerMove(char board[ROWS][COLS]);
// מנגנון בקרה המוודא כי המהלך חוקי לפני ביצועו
int isvalidMove(char board[ROWS][COLS], int num_of_cols);
//פונקציית עדכון נתונים האחראית על מציאת המיקום הפנוי הנמוך ביותר בעמודה ועדכון מצב הלוח בזיכרון 
int dropDisc(char board[ROWS][COLS], int col, int player);
// אלגוריתם זיהוי מצבים הסורק את סביבת הדסקית האחרונה שנפלה לזיהוי רצפים של ארבע דסקיות בכל הכיוונים: אופקי, אנכי ואלכסוני
int chekwin(char board[ROWS][COLS], int col, int row, int player);
//, מנגנון זיהוי מצב סיום מסוג תיקו – הפונקציה סורקת את השורה העליונה בלוח כדי לקבוע אם נותרו מהלכים אפשריים 
int isboardfull(char board[ROWS][COLS]);
//רכיב ניהול תורות האחראי על החלפת המזהה של השחקן הפעיל והעברת השליטה  
int switchplayer(int currentplayer);
//מנוע המשחק המרכזי לשני שחקנים – פונקציה זו מרכזת את כל תהליך המשחק: ניהול הלולאה המרכזית, קריאה לפונקציות הקלט, העדכון ובדיקת מצבי הניצחון עד להכרעה  
int playgame_humen_vs_humen();

// מנגנון קבלת החלטות בסיסי המבוסס על בחירה אקראית של עמודה מתוך טווח המהלכים החוקיים 
int easyStrategy(char board[ROWS][COLS]);
//פונקציה המבצעת חישוב מקדים של השורה הפנויה הנמוכה ביותר בעמודה נתונה. היא מהווה את התשתית לרמה הבינונית בכך שהיא מאפשרת למחשב "לצפות" היכן תמוקם הדסקית לפני ביצוע מהלך בפועל
int getRowForDisc(char board[ROWS][COLS], int col);
//פונקציה המממשת לוגיקה של "צעד אחד קדימה" על ידי סימולציה של מהלכים על הלוח
int mediumStrategy(char board[ROWS][COLS], int currentPlayer);
//פונקציית עזר חיונית לרמה הקשה ,  האחראית על מחיקת מהלכים זמניים מהלוח לאחר סיום הבדיקה שלהם. היא מאפשרת לאלגוריתם ה-Minimax  להריץ סימולציות מבלי לשנות את מצב המשחק האמיתי
void undoMove(char board[ROWS][COLS], int col);
//פונקציית הערכה אסטרטגית הסורקת את הלוח כולו (שורות, עמודות ואלכסונים). היא מחשבת ציון משוקלל למצב הלוח ונותנת עדיפות מובנית לעמודה המרכזית 
int evaluateBoard(char board[ROWS][COLS]);
//פונקציית עזר לרמה הקשה , המעניקה ניקוד חיובי על יצירת רצפי דסקיות של המחשב,וניקוד שלילי גבוה ("קנס") על מצבי איום של היריב הדורשים חסימה מיידית 
int scoreWindow(char c1, char c2, char c3, char c4);
//אלגוריתם רקורסיבי לחיזוי מהלכים עתידיים הוא פועל תחת ההנחה שהיריב ישחק בצורה אופטימלית ומנסה למקסם את הרווח של המחשב תוך צמצום אפשרויות הניצחון של השחקן
int minimax(char board[ROWS][COLS], int depth, int isMaximizing);
//המעטפת המנהלת את קבלת ההחלטות ברמה הקשה. היא עוברת על כל העמודות, מפעילה את ה- Minimax לכל מהלך אפשרי, ובוחרת בעמודה שהניבה את הציון הגבוה ביותר 
int hardStrategy(char board[ROWS][COLS]);
//פונקציית ניהול המשחק המרכזית האחראית על סנכרון זרימת המשחק בין השחקן למחשב. הפונקציה מנהלת את בחירת רמת הקושי, מבצעת בקרת קלט קפדנית, מפעילה את אלגוריתמי ה-AI השונים בהתאם לבחירת המשתמש, ומכריעה את המשחק במצבי ניצחון, הפסד או תיקו //
int playgame_humen_Vs_Computer(int difficulty);


#endif





